Microchip-MPLAB-Harmony/smartenergy_prime_apps/apps/prime_apps/prime_service_1_3_bin/src/packs/PIC32CX2051MTG128_DFP/component/pwm.h
/* -------- PWM_TNPR : (PWM Offset: 0x118) (R/W 32) Transmit Next Pointer Register -------- */
#define PWM_TNPR_TXNPTR_Pos                   _UINT32_(0)                                          /* (PWM_TNPR) Transmit Next Pointer Position */
#define PWM_TNPR_TXNPTR_Msk                   (_UINT32_(0xFFFFFFFF) << PWM_TNPR_TXNPTR_Pos)        /* (PWM_TNPR) Transmit Next Pointer Mask */
#define PWM_TNPR_TXNPTR(value)                (PWM_TNPR_TXNPTR_Msk & (_UINT32_(value) << PWM_TNPR_TXNPTR_Pos)) /* Assigment of value for TXNPTR in the PWM_TNPR register */
#define PWM_TNPR_Msk                          _UINT32_(0xFFFFFFFF)                                 /* (PWM_TNPR) Register Mask  */


/* -------- PWM_TNCR : (PWM Offset: 0x11C) (R/W 32) Transmit Next Counter Register -------- */
#define PWM_TNCR_TXNCTR_Pos                   _UINT32_(0)                                          /* (PWM_TNCR) Transmit Counter Next Position */
#define PWM_TNCR_TXNCTR_Msk                   (_UINT32_(0xFFFF) << PWM_TNCR_TXNCTR_Pos)            /* (PWM_TNCR) Transmit Counter Next Mask */
#define PWM_TNCR_TXNCTR(value)                (PWM_TNCR_TXNCTR_Msk & (_UINT32_(value) << PWM_TNCR_TXNCTR_Pos)) /* Assigment of value for TXNCTR in the PWM_TNCR register */
#define PWM_TNCR_Msk                          _UINT32_(0x0000FFFF)                                 /* (PWM_TNCR) Register Mask  */


/* -------- PWM_PTCR : (PWM Offset: 0x120) ( /W 32) Transfer Control Register -------- */
#define PWM_PTCR_RXTEN_Pos                    _UINT32_(0)                                          /* (PWM_PTCR) Receiver Transfer Enable Position */
#define PWM_PTCR_RXTEN_Msk                    (_UINT32_(0x1) << PWM_PTCR_RXTEN_Pos)                /* (PWM_PTCR) Receiver Transfer Enable Mask */
#define PWM_PTCR_RXTEN(value)                 (PWM_PTCR_RXTEN_Msk & (_UINT32_(value) << PWM_PTCR_RXTEN_Pos)) /* Assigment of value for RXTEN in the PWM_PTCR register */
#define PWM_PTCR_RXTDIS_Pos                   _UINT32_(1)                                          /* (PWM_PTCR) Receiver Transfer Disable Position */
#define PWM_PTCR_RXTDIS_Msk                   (_UINT32_(0x1) << PWM_PTCR_RXTDIS_Pos)               /* (PWM_PTCR) Receiver Transfer Disable Mask */
#define PWM_PTCR_RXTDIS(value)                (PWM_PTCR_RXTDIS_Msk & (_UINT32_(value) << PWM_PTCR_RXTDIS_Pos)) /* Assigment of value for RXTDIS in the PWM_PTCR register */
#define PWM_PTCR_TXTEN_Pos                    _UINT32_(8)                                          /* (PWM_PTCR) Transmitter Transfer Enable Position */
#define PWM_PTCR_TXTEN_Msk                    (_UINT32_(0x1) << PWM_PTCR_TXTEN_Pos)                /* (PWM_PTCR) Transmitter Transfer Enable Mask */
#define PWM_PTCR_TXTEN(value)                 (PWM_PTCR_TXTEN_Msk & (_UINT32_(value) << PWM_PTCR_TXTEN_Pos)) /* Assigment of value for TXTEN in the PWM_PTCR register */
#define PWM_PTCR_TXTDIS_Pos                   _UINT32_(9)                                          /* (PWM_PTCR) Transmitter Transfer Disable Position */
#define PWM_PTCR_TXTDIS_Msk                   (_UINT32_(0x1) << PWM_PTCR_TXTDIS_Pos)               /* (PWM_PTCR) Transmitter Transfer Disable Mask */
#define PWM_PTCR_TXTDIS(value)                (PWM_PTCR_TXTDIS_Msk & (_UINT32_(value) << PWM_PTCR_TXTDIS_Pos)) /* Assigment of value for TXTDIS in the PWM_PTCR register */
#define PWM_PTCR_RXCBEN_Pos                   _UINT32_(16)                                         /* (PWM_PTCR) Receiver Circular Buffer Enable Position */
#define PWM_PTCR_RXCBEN_Msk                   (_UINT32_(0x1) << PWM_PTCR_RXCBEN_Pos)               /* (PWM_PTCR) Receiver Circular Buffer Enable Mask */
#define PWM_PTCR_RXCBEN(value)                (PWM_PTCR_RXCBEN_Msk & (_UINT32_(value) << PWM_PTCR_RXCBEN_Pos)) /* Assigment of value for RXCBEN in the PWM_PTCR register */
#define PWM_PTCR_RXCBDIS_Pos                  _UINT32_(17)                                         /* (PWM_PTCR) Receiver Circular Buffer Disable Position */
#define PWM_PTCR_RXCBDIS_Msk                  (_UINT32_(0x1) << PWM_PTCR_RXCBDIS_Pos)              /* (PWM_PTCR) Receiver Circular Buffer Disable Mask */
#define PWM_PTCR_RXCBDIS(value)               (PWM_PTCR_RXCBDIS_Msk & (_UINT32_(value) << PWM_PTCR_RXCBDIS_Pos)) /* Assigment of value for RXCBDIS in the PWM_PTCR register */
#define PWM_PTCR_TXCBEN_Pos                   _UINT32_(18)                                         /* (PWM_PTCR) Transmitter Circular Buffer Enable Position */
#define PWM_PTCR_TXCBEN_Msk                   (_UINT32_(0x1) << PWM_PTCR_TXCBEN_Pos)               /* (PWM_PTCR) Transmitter Circular Buffer Enable Mask */
#define PWM_PTCR_TXCBEN(value)                (PWM_PTCR_TXCBEN_Msk & (_UINT32_(value) << PWM_PTCR_TXCBEN_Pos)) /* Assigment of value for TXCBEN in the PWM_PTCR register */
#define PWM_PTCR_TXCBDIS_Pos                  _UINT32_(19)                                         /* (PWM_PTCR) Transmitter Circular Buffer Disable Position */
#define PWM_PTCR_TXCBDIS_Msk                  (_UINT32_(0x1) << PWM_PTCR_TXCBDIS_Pos)              /* (PWM_PTCR) Transmitter Circular Buffer Disable Mask */
#define PWM_PTCR_TXCBDIS(value)               (PWM_PTCR_TXCBDIS_Msk & (_UINT32_(value) << PWM_PTCR_TXCBDIS_Pos)) /* Assigment of value for TXCBDIS in the PWM_PTCR register */
#define PWM_PTCR_ERRCLR_Pos                   _UINT32_(24)                                         /* (PWM_PTCR) Transfer Bus Error Clear Position */
#define PWM_PTCR_ERRCLR_Msk                   (_UINT32_(0x1) << PWM_PTCR_ERRCLR_Pos)               /* (PWM_PTCR) Transfer Bus Error Clear Mask */
#define PWM_PTCR_ERRCLR(value)                (PWM_PTCR_ERRCLR_Msk & (_UINT32_(value) << PWM_PTCR_ERRCLR_Pos)) /* Assigment of value for ERRCLR in the PWM_PTCR register */
#define PWM_PTCR_Msk                          _UINT32_(0x010F0303)                                 /* (PWM_PTCR) Register Mask  */


/* -------- PWM_PTSR : (PWM Offset: 0x124) ( R/ 32) Transfer Status Register -------- */
#define PWM_PTSR_RXTEN_Pos                    _UINT32_(0)                                          /* (PWM_PTSR) Receiver Transfer Enable Position */
#define PWM_PTSR_RXTEN_Msk                    (_UINT32_(0x1) << PWM_PTSR_RXTEN_Pos)                /* (PWM_PTSR) Receiver Transfer Enable Mask */
#define PWM_PTSR_RXTEN(value)                 (PWM_PTSR_RXTEN_Msk & (_UINT32_(value) << PWM_PTSR_RXTEN_Pos)) /* Assigment of value for RXTEN in the PWM_PTSR register */
#define PWM_PTSR_TXTEN_Pos                    _UINT32_(8)                                          /* (PWM_PTSR) Transmitter Transfer Enable Position */
#define PWM_PTSR_TXTEN_Msk                    (_UINT32_(0x1) << PWM_PTSR_TXTEN_Pos)                /* (PWM_PTSR) Transmitter Transfer Enable Mask */
#define PWM_PTSR_TXTEN(value)                 (PWM_PTSR_TXTEN_Msk & (_UINT32_(value) << PWM_PTSR_TXTEN_Pos)) /* Assigment of value for TXTEN in the PWM_PTSR register */
#define PWM_PTSR_RXCBEN_Pos                   _UINT32_(16)                                         /* (PWM_PTSR) Receiver Circular Buffer Enable Position */
#define PWM_PTSR_RXCBEN_Msk                   (_UINT32_(0x1) << PWM_PTSR_RXCBEN_Pos)               /* (PWM_PTSR) Receiver Circular Buffer Enable Mask */
#define PWM_PTSR_RXCBEN(value)                (PWM_PTSR_RXCBEN_Msk & (_UINT32_(value) << PWM_PTSR_RXCBEN_Pos)) /* Assigment of value for RXCBEN in the PWM_PTSR register */
#define PWM_PTSR_TXCBEN_Pos                   _UINT32_(18)                                         /* (PWM_PTSR) Transmitter Circular Buffer Enable Position */
#define PWM_PTSR_TXCBEN_Msk                   (_UINT32_(0x1) << PWM_PTSR_TXCBEN_Pos)               /* (PWM_PTSR) Transmitter Circular Buffer Enable Mask */
#define PWM_PTSR_TXCBEN(value)                (PWM_PTSR_TXCBEN_Msk & (_UINT32_(value) << PWM_PTSR_TXCBEN_Pos)) /* Assigment of value for TXCBEN in the PWM_PTSR register */
#define PWM_PTSR_ERR_Pos                      _UINT32_(24)                                         /* (PWM_PTSR) Transfer Bus Error Position */
#define PWM_PTSR_ERR_Msk                      (_UINT32_(0x1) << PWM_PTSR_ERR_Pos)                  /* (PWM_PTSR) Transfer Bus Error Mask */
#define PWM_PTSR_ERR(value)                   (PWM_PTSR_ERR_Msk & (_UINT32_(value) << PWM_PTSR_ERR_Pos)) /* Assigment of value for ERR in the PWM_PTSR register */
#define PWM_PTSR_Msk                          _UINT32_(0x01050101)                                 /* (PWM_PTSR) Register Mask  */


/* -------- PWM_PWPMR : (PWM Offset: 0x128) (R/W 32) Write Protection Mode Register -------- */
#define PWM_PWPMR_WPPTREN_Pos                 _UINT32_(0)                                          /* (PWM_PWPMR) Write Protection Pointer Registers Enable Position */
#define PWM_PWPMR_WPPTREN_Msk                 (_UINT32_(0x1) << PWM_PWPMR_WPPTREN_Pos)             /* (PWM_PWPMR) Write Protection Pointer Registers Enable Mask */
#define PWM_PWPMR_WPPTREN(value)              (PWM_PWPMR_WPPTREN_Msk & (_UINT32_(value) << PWM_PWPMR_WPPTREN_Pos)) /* Assigment of value for WPPTREN in the PWM_PWPMR register */
#define PWM_PWPMR_WPCTREN_Pos                 _UINT32_(1)                                          /* (PWM_PWPMR) Write Protection Counter Registers Enable Position */
#define PWM_PWPMR_WPCTREN_Msk                 (_UINT32_(0x1) << PWM_PWPMR_WPCTREN_Pos)             /* (PWM_PWPMR) Write Protection Counter Registers Enable Mask */
#define PWM_PWPMR_WPCTREN(value)              (PWM_PWPMR_WPCTREN_Msk & (_UINT32_(value) << PWM_PWPMR_WPCTREN_Pos)) /* Assigment of value for WPCTREN in the PWM_PWPMR register */
#define PWM_PWPMR_WPCREN_Pos                  _UINT32_(2)                                          /* (PWM_PWPMR) Write Protection Control Register Enable Position */
#define PWM_PWPMR_WPCREN_Msk                  (_UINT32_(0x1) << PWM_PWPMR_WPCREN_Pos)              /* (PWM_PWPMR) Write Protection Control Register Enable Mask */
#define PWM_PWPMR_WPCREN(value)               (PWM_PWPMR_WPCREN_Msk & (_UINT32_(value) << PWM_PWPMR_WPCREN_Pos)) /* Assigment of value for WPCREN in the PWM_PWPMR register */
#define PWM_PWPMR_WPKEY_Pos                   _UINT32_(8)                                          /* (PWM_PWPMR) Write Protection Key Position */
#define PWM_PWPMR_WPKEY_Msk                   (_UINT32_(0xFFFFFF) << PWM_PWPMR_WPKEY_Pos)          /* (PWM_PWPMR) Write Protection Key Mask */
#define PWM_PWPMR_WPKEY(value)                (PWM_PWPMR_WPKEY_Msk & (_UINT32_(value) << PWM_PWPMR_WPKEY_Pos)) /* Assigment of value for WPKEY in the PWM_PWPMR register */
#define   PWM_PWPMR_WPKEY_PASSWD_Val          _UINT32_(0x504443)                                   /* (PWM_PWPMR) Writing any other value in this field aborts the write operation. Always reads as 0.  */
#define PWM_PWPMR_WPKEY_PASSWD                (PWM_PWPMR_WPKEY_PASSWD_Val << PWM_PWPMR_WPKEY_Pos)  /* (PWM_PWPMR) Writing any other value in this field aborts the write operation. Always reads as 0. Position  */
#define PWM_PWPMR_Msk                         _UINT32_(0xFFFFFF07)                                 /* (PWM_PWPMR) Register Mask  */


/* -------- PWM_CMUPD0 : (PWM Offset: 0x400) ( /W 32) PWM Channel Mode Update Register (ch_num = 0) -------- */
#define PWM_CMUPD0_CPOLUP_Pos                 _UINT32_(9)                                          /* (PWM_CMUPD0) Channel Polarity Update Position */
#define PWM_CMUPD0_CPOLUP_Msk                 (_UINT32_(0x1) << PWM_CMUPD0_CPOLUP_Pos)             /* (PWM_CMUPD0) Channel Polarity Update Mask */
#define PWM_CMUPD0_CPOLUP(value)              (PWM_CMUPD0_CPOLUP_Msk & (_UINT32_(value) << PWM_CMUPD0_CPOLUP_Pos)) /* Assigment of value for CPOLUP in the PWM_CMUPD0 register */
#define PWM_CMUPD0_CPOLINVUP_Pos              _UINT32_(13)                                         /* (PWM_CMUPD0) Channel Polarity Inversion Update Position */
#define PWM_CMUPD0_CPOLINVUP_Msk              (_UINT32_(0x1) << PWM_CMUPD0_CPOLINVUP_Pos)          /* (PWM_CMUPD0) Channel Polarity Inversion Update Mask */
#define PWM_CMUPD0_CPOLINVUP(value)           (PWM_CMUPD0_CPOLINVUP_Msk & (_UINT32_(value) << PWM_CMUPD0_CPOLINVUP_Pos)) /* Assigment of value for CPOLINVUP in the PWM_CMUPD0 register */
#define PWM_CMUPD0_Msk                        _UINT32_(0x00002200)                                 /* (PWM_CMUPD0) Register Mask  */


